#ifndef __PRACTICE_HPP_INCLUDED__
#define __PRACTICE_HPP_INCLUDED__

// 1. Преговор от миналото упражнение

/* 
Сложност на алгоритми:

for (int i = 1; i <= n; i++)
    for (int j = 1; j <= n; j *= 2)
        count++;

*/

// 2. Рекурсия

/*
    1) Всяко итеративно решение има рекурсивно, но не всяко рекурсивно решение има итеративно!
    2) Каква беше цената на рекурсията?
*/


// ------------------------------------------------------------------------------------------------------------------------------------

// 1. Какво са структурите от данни. Описание и характеристика.

// 2. Какво е АСД, какво е АСД масив?

// 3. Сложности на операциите над един масив 

// ------------------------------------------------------------------------------------------------------------------------------------

// Шаблони на класове, какво си спомняме?

// 1. Какво правят шаблоните - code generation vs code dispatching 

// 2. Синтаксис на шаблон - template <typename/class MyType>

template<typename T>
struct template_example
{
    T someVal;

    void someFoo(T val) { someVal = val; }
    T getVal() { return someVal; }
};

// 3. Имплицитни генерация срещу експлицитна генерация?

// 4. Къде пишем дефинициите на шаблонни функции и защо 

/*
    Рецептата и рестуранта - един рестурант казва че предлага прекрасна сьомга (това е hpp файла) обаче е дал рецептата на местната суши будка пред рестуранта (това е .cpp файла), там всички ядат junk food и на никой не му трябва сьомга, затова готвачът в будката изхвърля рецептата в кофата.

    Обаче...

    По едно време някой поръчва сьомга в рестуранта и шефовете тръгват да тичат да вземата рецептата, това е вашият линкер, обаче рецептата е хвърлена тъй като шефът на долната будка (компилаторът) не я е намерил за потребена.

    Поука - ДРЪЖТЕ РЕЦЕПТАТА В РЕСТУРАНТА 
*/

// 5. Зависими имена при вложени типове - защо ползваме typename


















// ------------------------------------------------------------------------------------------------------------------------------------

// Имплементация на базовите методи на динамичен масив 

// Използване на placement new 

// 1) Повикване -> new (блок памет) Type(конструктор)

// 2) Премахване -> obj->~Type(); експлицитен деструктор

// ------------------------------------------------------------------------------------------------------------------------------------

// Сортиран масив -> какво се променя?

#endif